KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
#include "esp32-hal-log.h"
#ifndef _FUNCTIONS_H_
#define _FUNCTIONS_H_

#include "global.h"
#include "getTimeHMS.h"
#include "message_esp_now.h"
#include <csignal>
#include <cstdint>

#pragma region ________________________________ Constants

const char *team_names[3] = {
    "    ",
    " RED",
    "BLUE"
};

// enum bomb_t {BS_IDLE = 0, BS_RUN, BS_STOP};

const uint32_t arTimeMikers[4] = {10, 30, 60, 300};
const uint32_t arBombTimeMikers[2] = {300000, 480000};

#pragma endregion Constants


#pragma region ________________________________ Variables

uint8_t G_u8Team;                             // активная команда
TimerExt game_timer(false);                   // таймер обратного счета времени игры
TimerExt bomb_timer(false);                   // таймер обратного счета времени бомбы
TimerExt timerRed(true);                      // таймер прямого счета команды красных
TimerExt timerBlue(true);                     // таймер прямого счета команды синих

#pragma endregion Variables

void printTFTText(String text, uint16_t x, uint16_t y, bool centerByX, bool CenterByY, const GFXfont *font){
    tft.setFreeFont(font);

    if (centerByX) {
        x = (DISPLAY_WIDTH - tft.textWidth(text)) / 2;
    }
	else { x = x + PADDING; }

    if (CenterByY) {
        y = (DISPLAY_HEIGHT - tft.fontHeight()) / 2;
    }
	else { y = y + PADDING; }

	tft.drawString(text, x, y);

	//tft.unloadFont();
}

uint16_t getTextWidth(String s, const GFXfont *font) {
	tft.setFreeFont(font);
	uint16_t width = tft.textWidth(s);
	return width;
}

void clearScreen() {
	tft.fillScreen(TFT_BLACK);
}

void clearSpace(uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint32_t color) {
    tft.fillRect(x, y, width, height, color);
}


/*void display3DigitsInt(uint8_t col, uint8_t row, uint16_t var, char zero = ' ') {
    //----------------------------------------------------------------------------+
    //               Вывод двухзначного числа с лидирующим нулем                  |
    //  [in]  col  - колонка первого символа                                      |
    //  [in]  row  - строка первого символа                                       |
    //  [in]  var  - число (0..999)                                               |
    //  [in]  zero - '0'- лидирующиq нуль                                       |
    //----------------------------------------------------------------------------+
    lcd.setCursor(col, row);
    if (var < 100)
        lcd.write(zero);
    else if (var < 10)
        lcd.write(zero);
    lcd.print(var);
}*/

String prapare3DigitsIntVar(uint16_t var) {
	static String resultString;

	if (var < 100) resultString = " ";
	else if (var < 10) resultString = "  ";
	resultString = resultString + (String)var;

	return resultString;
}

uint32_t ProcessButton(const Button button, uint8_t *progress, uint32_t *time) {
    if (button.isReleased()) {
        *progress = 0;
        *time = xTaskGetTickCount();
        clearSpace(0, PROGRESS_BAR_Y_POSITION, DISPLAY_WIDTH, PROGRESS_BAR_HEIGHT, TFT_BLACK);
        return 0;
    }

    //if (*progress == 0) {
    //    clearSpace(0, PADDING, DISPLAY_WIDTH, HEADER_SPACE_H, TFT_BLACK);
    //}

	espnow_msg_t msg;
    uint32_t var = (xTaskGetTickCount() - *time);
    uint8_t new_progress = map(var, 0, G_u32ActivationTimeMS, 0, MAX_PROGRESS);

    while (*progress < new_progress && *progress < MAX_PROGRESS) {

		// if (*progress % 10 == 0) {
			// msg.cmd = LIGHT_LEDS_BY_PROGRESS;
			// msg.data[0] = 2;
      		// msg.data[1] = G_u8Team;
			// msg.data[2] = *progress;
			// if (!q_out_msg.push(&msg))
			// 	log_e("Error: q_out_msg is full");
		// }

		tft.fillRect(PROGRESS_BAR_X_POSITION, PROGRESS_BAR_Y_POSITION, map(*progress, 0, MAX_PROGRESS, 0, PROGRESS_BAR_WIDTH), PROGRESS_BAR_HEIGHT, TFT_WHITE);
        tone(BUZZER_PIN, *progress * 25);
        *progress = new_progress;
		log_d("progress: %d; progress bar width: %d", *progress, map(*progress, 0, MAX_PROGRESS, 0, PROGRESS_BAR_WIDTH));

		if (*progress >= MAX_PROGRESS) {
			clearSpace(0, PROGRESS_BAR_Y_POSITION, DISPLAY_WIDTH, PROGRESS_BAR_HEIGHT, TFT_BLACK);
			*progress = MAX_PROGRESS;

      		// msg.cmd = LIGHT_LEDS_BY_PROGRESS;
			// msg.data[0] = 2;
      		// msg.data[1] = G_u8Team;
			// msg.data[2] = *progress;
			// if (!q_out_msg.push(&msg))
				// log_e("Error: q_out_msg is full");
        
			return MAX_PROGRESS;
		}
    }


    return *progress * 100UL / PROGRESS_BAR_WIDTH;
}

bool isButtonPressed(Button* button) {
  button->read();
  if (button->isReleased())
    return false;
  else
    return true;
}


void parseMessage(espnow_event_t* send_event, espnow_msg_t* recv_msg) {
    if (send_event->msg.cmd == PING) {
		static uint32_t tm = 0;
        uint8_t point = send_event->msg.data[0];
        G_arPeerStatus[point] = PEER_NO_CONNECT;        // Упреждающая установка. При успешном приеме будет перезаписана
        if (send_event->status & MSG_RECV_OK) {
            log_i("сообщение принято");
            if (point == recv_msg->data[0])
                G_arPeerStatus[point] = recv_msg->data[1];      // если сообщение принято
        }
        // отрисовка состояния точки
			printTFTText(sPointNameStates[G_arPeerStatus[point]],
						 NO_X, HEADER_SPACE_H+STRING_SPACE_H*(point+1),
						 CENTER_BY_X, NOT_CENTER_BY_Y, STRING_FONT);
			tm = xTaskGetTickCount();
    }
}


bool sendESP_NOW() {
    //----------------------------------------------------------------------------+
    //                  Передать сообщение через ESPNOW                           |
    //  return true, если передача завершена, иначе false                         |
    //----------------------------------------------------------------------------+
    static uint8_t st = 0;
    uint32_t rv;

    if (st == 0) {
        if (q_out_msg.getCount() == 0) return true;

        q_out_msg.pop(&send_evt.msg);
        send_evt.status = MSG_RDY_TO_SEND;
        xTaskNotify(hTaskWiFi, NTF_SEND_WIFI, eSetBits);
        st++;
    }
    else if (xTaskNotifyWait(0, NTF_SEND_FINAL, &rv, 0) == pdTRUE) {
        send_evt.status |= MSG_SEND_FINAL;
        parseMessage(&send_evt, &recv_evt.msg);
        st = 0;
    }  // pdFALSE - если тайм-аут
    return false;
}

void RenderStaticView() {
    switch (G_u8GameMode) {
        case DOMIN:
			    printTFTText("DOMINATION", NO_X, PADDING, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);


          if (G_u8Team != NOONE) {
              printTFTText("====>", NO_X, PADDING+HEADER_SPACE_H*G_u8Team+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
          }
          else {
            printTFTText("           ", NO_X, PADDING+HEADER_SPACE_H+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            printTFTText("           ", NO_X, PADDING+HEADER_SPACE_H*2+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
          }
          break;

        case DOMIN_PRO:
			printTFTText("DOMINATION PRO", NO_X, SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            break;

        case BOMB:
        case CTRL_POINT:
            /*
            Строка 0:
            "BOMB MODE" - нет авторизации и нет активации/дезактивации
            "Enter PASS> ********" - идет авторизация
            "ARMING" - идет активация заряда
            "DISARMING" - идет дезактивация заряда

            Строка 1:
            "GAME TIME   00:15:20" - нет активации/дезактивации
            "====================" - идет активация/дезактивация заряда (progress bar)

            Строка 2:
            "" - IDLE, STOP заряд не активирован или остановленнет активации/дезактивации
            "====================" - идет активация/дезактивация заряда (progress bar)

            Строка 3:
            "" - заряд не был активирован IDLE
            "BOMB TIME   00:01:59" - RUN-STOP-END-BOOM
            "====================" - идет активация/дезактивация заряда (progress bar)
            */
            if (G_u8GameMode == BOMB)
				      printTFTText("BOMB MODE", NO_X, SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            else
				      printTFTText("CONTROL POINT", NO_X, SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
			      printTFTText("Game time: "+(String)getTimeHMS(game_timer.Secs()), PADDING, PADDING+HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, STRING_FONT);
            break;
    }
}


int8_t getTimeMarker(uint32_t secs) {
    for (int8_t i = 4; i > 0; i--)
        if (secs >= arTimeMikers[i-1]) return i;
    return 0;
}


bool enterPassword(bool *fCursorChange) {
    const uint8_t max_chars = 8;
    const uint8_t start_pos = 20 - max_chars;
    static uint8_t st = 0;
    static uint16_t phraseWidth = getTextWidth("Enter PASS> ", HEADER_FONT);
	static uint16_t underscoreWidth = getTextWidth("_", HEADER_FONT);
    static String inputString = "        ";
    static uint8_t index;
    static uint32_t tm;
    char key;

    switch (st) {
        case 0:                 // ожидание нажатия любой кнопки - отрисовка приглашения
            if (kpd.getKey() != NO_KEY) {
                tone(BUZZER_PIN, BUZZER_BUTTON, BUZZER_DURATION);
                //lcd.setCursor(0, 0);
                //lcd.print(F("Enter PASS> ********"));
				uint8_t labelStartPosition = (DISPLAY_WIDTH - phraseWidth - underscoreWidth*max_chars)/2;
				printTFTText("Enter PASS> ", labelStartPosition, 0, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
				for (uint8_t i = 0; i < max_chars; i++) {
					printTFTText("_", phraseWidth+(underscoreWidth+12)*i, 0, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
				}
                inputString = "        ";
                index = 0;
                //lcd.setCursor(start_pos + index, 0);
                //lcd.blink();
                st++;
            }
            break;

        case 1:                     // редактирование
            if (*fCursorChange) {
                //lcd.setCursor(start_pos + index, 0);
                *fCursorChange = false;
            }
            key = kpd.getKey();
            if (key >= '0' && key <= '9') {
                tone(BUZZER_PIN, BUZZER_BUTTON, BUZZER_DURATION);
                if (key == G_sPassword[index]) {
                    inputString[index] = key;
                    //lcd.write(inputString[index]);
					printTFTText((String)key, phraseWidth+(underscoreWidth+12)*index, 0, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                    if (++index == max_chars)
                    {
                        //lcd.noBlink();
                        //lcd.setCursor(0,0);
                        //lcd.print(F("    Password OK !   "));
						clearSpace(0, 0, DISPLAY_WIDTH, HEADER_HEIGHT, TFT_BLACK);
						printTFTText("Password OK !", NO_X, 0, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                        tm = xTaskGetTickCount();
                        st++;
                    }
                }
            }
            break;

        case 2:                     // 2 сек показываем сообщение "Password OK !"
            if (xTaskGetTickCount() - tm >= 2000) {
                tone(BUZZER_PIN, BUZZER_BUTTON, BUZZER_DURATION);
                st = 0;
                return true;
            }
            break;
    }
    return false;
}


bool Domination(ListParameter* params, team_t* winner) {
    //----------------------------------------------------------------------------+
    // строка 0: Название игры                                                    |
    // строка 1: таймер обратного отсчёта времени игры.                           |
    // нижней строке таймеры времени доминирования для каждой команды.            |
    // Побеждает команда, чей таймер показывает большее время доминирования.      |
    //----------------------------------------------------------------------------+
    /*
     01234567890123456789 01234567890123456789
    +--------------------+--------------------+
    |     DOMINATION     |       АRMING       |
    |      00:00:00      |**************      |
    | RED ====>  00:00:00| RED        00:00:00|
    |BLUE        00:00:00|BLUE        00:00:00|
    +--------------------+--------------------+*/
    static uint8_t st = 0;
    static uint32_t secs = game_timer.Secs();
	static uint16_t teamTimerPositionX = DISPLAY_WIDTH-getTextWidth("00:00:00   ", HEADER_FONT)-PADDING;
	static uint16_t redTimerPositionY = PADDING+HEADER_SPACE_H+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE;
	static uint16_t blueTimerPositionY = PADDING+HEADER_SPACE_H+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE+HEADER_SPACE_H;
    static uint32_t time_press_red = xTaskGetTickCount();
    static uint32_t time_press_blue = xTaskGetTickCount();
    static uint8_t progressRed = 0;
    static uint8_t progressBlue = 0;
    static uint32_t prev; // пред. значения таймера команды, владеющей точкой
    static uint8_t point; // 0,1
    static bool fEmpty = true;

    static int8_t i8CheckTimeCount;
    espnow_msg_t outMsg;
    espnow_msg_t ledMsg;

    switch (st)
    {
        case 0:
            clearScreen();
            G_u8Team = NOONE;
            printTFTText("DOMINATION", NO_X, PADDING, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            game_timer.SetTime(G_u32GameTimeMS);  // устанавливаем таймер игры
            secs = game_timer.Secs();

            i8CheckTimeCount = getTimeMarker(secs);

            ledMsg.cmd = WAITING;
            ledMsg.data[0] = 2;
            ledMsg.data[1] = G_u8Team;
            if (!q_out_msg.push(&ledMsg))
              log_e("Error: q_out_msg is full");

            printTFTText(getTimeHMS(secs), NO_X, PADDING+HEADER_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, STRING_FONT);
            printTFTText(team_names[RED], PADDING, PADDING+HEADER_SPACE_H+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            printTFTText(team_names[BLUE], PADDING, PADDING+HEADER_SPACE_H*2+STRING_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);


                  // таймеры команд
            printTFTText(getTimeHMS(timerRed.Secs()), teamTimerPositionX, redTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            printTFTText(getTimeHMS(timerBlue.Secs()), teamTimerPositionX, blueTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);

