KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
            game_timer.Start();                   // запускаем таймер игры
            st++;
            break;

        case 1:    // отрисовка команды-владельца gamepad
            RenderStaticView();
            st++;
            break;

        case 2:
            if (isButtonPressed(&redButton) || isButtonPressed(&blueButton)) {
                uint8_t*  armingTeamProgress;
                uint32_t* timePress;
                Button*   armingTeamButton;
                uint8_t   armingTeamNumber;

                progressRed = 0;
                progressBlue = 0;

                if (isButtonPressed(&redButton)) {
                  armingTeamProgress = &progressRed;
                  timePress = &time_press_red;
                  armingTeamButton = &redButton;
                  armingTeamNumber = RED;
                }
                else {
                  armingTeamProgress = &progressBlue;
                  timePress = &time_press_blue;
                  armingTeamButton = &blueButton;
                  armingTeamNumber = BLUE;
                }
                *timePress = xTaskGetTickCount();

                if (G_u8Team == NOONE) {
					          printTFTText("    ARMING    ", NO_X, PADDING, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_CAP_POINT;

                    ledMsg.cmd = START_ARMING;
                    ledMsg.data[1] = armingTeamNumber;
                }
                else {
					          printTFTText("  DISARMING  ", NO_X, PADDING, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                    // Проигрываем на базе команды, которая не деактивирует точку
                    outMsg.data[0] = G_u8Team - 1;
                    outMsg.data[1] = MP3_CAP_OUR_POINT;

                    ledMsg.cmd = START_DISARMING;
                    ledMsg.data[1] = G_u8Team;
                }
                outMsg.cmd = PLAY_TRACK;
                if (!q_out_msg.push(&outMsg))
                    log_e("Error: q_out_msg is full");
                if (!q_out_msg.push(&ledMsg))
                  log_e("Error: q_out_msg is full");

                

                do {

                  *armingTeamProgress = map(millis() - *timePress, 0, G_u32ActivationTimeMS, 0, MAX_PROGRESS);
                  tone(BUZZER_PIN, *armingTeamProgress * 25);

                  tft.fillRect(PROGRESS_BAR_X_POSITION, PROGRESS_BAR_Y_POSITION,
                               map(*armingTeamProgress, 0, MAX_PROGRESS, 0, PROGRESS_BAR_WIDTH),
                               PROGRESS_BAR_HEIGHT, TFT_WHITE);
                  
                  if (*armingTeamProgress >= MAX_PROGRESS) {
                    log_i("Progress is 100");
                    clearSpace(0, PROGRESS_BAR_Y_POSITION, DISPLAY_WIDTH, PROGRESS_BAR_HEIGHT, TFT_BLACK);
                    *armingTeamProgress = MAX_PROGRESS;
                    st++;
                  }

                  if (!isButtonPressed(armingTeamButton)) {
                    log_i("Button released");
                    *armingTeamProgress = 0;
                    clearSpace(0, PROGRESS_BAR_Y_POSITION, DISPLAY_WIDTH, PROGRESS_BAR_HEIGHT, TFT_BLACK);
                    ledMsg.cmd = WAITING;
                    ledMsg.data[0] = 2;
                    ledMsg.data[1] = G_u8Team;
                    if (!q_out_msg.push(&ledMsg))
                      log_e("Error: q_out_msg is full");
                    break;
                  }
                } while (*armingTeamProgress < MAX_PROGRESS);
            }
            break;

        case 3:                                       // точка захвачена
              if (G_u8Team == NOONE) {
                  if (progressRed >= 100) {
                      timerRed.Start();
                      timerBlue.Stop();
                      G_u8Team = RED;
                      log_d("red team timer started. team is RED");
                  }
                  else if (progressBlue >= 100) {
                      timerBlue.Start();
                      timerRed.Stop();
                      G_u8Team = BLUE;
                      log_d("blue team timer started. team is BLUE");
                  }

                  outMsg.cmd = PLAY_TRACK;
                  outMsg.data[0] = G_u8Team - 1;
                  outMsg.data[1] = MP3_WE_CAP_POINT;
                  if (!q_out_msg.push(&outMsg))
                      log_e("Error: q_out_msg is full");

                  outMsg.data[0] = G_u8Team == RED ? BLUE - 1: RED - 1;
                  outMsg.data[1] = MP3_ENEMY_CAP_POINT;
                  if (!q_out_msg.push(&outMsg))
                      log_e("Error: q_out_msg is full");
              }
              else {
                  timerRed.Stop();
                  timerBlue.Stop();
                  outMsg.data[0] = G_u8Team - 1;
                  outMsg.data[1] = MP3_WE_LOST_POINT;
                  outMsg.cmd = PLAY_TRACK;
                  if (!q_out_msg.push(&outMsg))
                      log_e("Error: q_out_msg is full");
                  G_u8Team = NOONE;
              }

              ledMsg.cmd = WAITING;
              ledMsg.data[1] = G_u8Team;
              if (!q_out_msg.push(&ledMsg))
                log_e("Error: q_out_msg is full");

              RenderStaticView();
              st++; // точка захвачена/освобождена
            break;

        case 4:  // ждем отжатия обоих кнопок
            if (!isButtonPressed(&redButton) && !isButtonPressed(&blueButton)) {
                st = 1;
                ledMsg.cmd = WAITING;
                ledMsg.data[1] = G_u8Team;
                if (!q_out_msg.push(&ledMsg))
        					log_e("Error: q_out_msg is full");
            }
            break;

        case 5:  // время игры истекло
            if (timerRed.GetTime() == timerBlue.GetTime())
                *winner = NOONE;
            else
                *winner = timerRed.GetTime() > timerBlue.GetTime() ? RED : BLUE;
            st++;

