KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
        case 6:
            if (fEmpty) {
                st = 0;
                return true;
            }
            break;
    } // switch

    fEmpty = sendESP_NOW();

    if (st < 5) {
      game_timer.Tick();
      if (!game_timer.GetTime()) {  // Если время игры истекло
          timerRed.Stop();
          timerBlue.Stop();
          game_timer.Stop();
          printTFTText(getTimeHMS(timerRed.Secs()), teamTimerPositionX, redTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
          printTFTText(getTimeHMS(timerBlue.Secs()), teamTimerPositionX, blueTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
          st = 5;
      }
      else /* if (st != 3) */ {
        if (game_timer.Secs() != secs) {
            secs = game_timer.Secs();
            printTFTText(getTimeHMS(secs), NO_X, PADDING+HEADER_SPACE_H+PROGRESS_BAR_HEIGHT+SPACE, CENTER_BY_X, NOT_CENTER_BY_Y, STRING_FONT);
            tone(BUZZER_PIN, BUZZER_FREQUENCY, BUZZER_DURATION);
        }

        if (G_u8Team == RED && st != 3) {
            timerRed.Tick();
            if (timerRed.Secs() != prev) {
              prev = timerRed.Secs();
              printTFTText(getTimeHMS(timerRed.Secs()), teamTimerPositionX, redTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            }
        }
        else if (G_u8Team == BLUE && st != 3) {
            timerBlue.Tick();
            if (timerBlue.Secs() != prev) {
              prev = timerBlue.Secs();
              printTFTText(getTimeHMS(timerBlue.Secs()), teamTimerPositionX, blueTimerPositionY, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            }
        }

        if (i8CheckTimeCount) {
          if (secs <= arTimeMikers[i8CheckTimeCount - 1]) {
              outMsg.cmd = PLAY_TRACK;
              outMsg.data[0] = BROADCAST;
              outMsg.data[1] = MP3_MISSION_END_10S + i8CheckTimeCount - 1;
              if (!q_out_msg.push(&outMsg))
                  log_e("Error: q_out_msg is full");
              i8CheckTimeCount--;
          }
        }
      }
    }
    return false;
}


bool Bomb(ListParameter* params, team_t* winner) {
    //----------------------------------------------------------------------------+
    // При старте таймер игры остановлен. При нажатии любой кнопки на клавиатуре, |
    // на дисплее появляется приглашение для ввода пароля. Игрок вводит пароль и  |
    // если он верный, разрешается активация заряда нажатием любой из кнопок.     |
    // После активации запускается таймер игры и таймер времени заряда.|
    // Также высвечивается команда, активировавшая заряд. Заряд можно деактивиро- |
    // вать, но потребуется ввод пароля. Игра продолжается до обнуления таймера   |
    // заряда или таймера игры или деактивации заряда. Побеждпет команда,         |
    // обнулившая таймер заряда или деактивировшая его.                           |
    //----------------------------------------------------------------------------+
    /*
     01234567890123456789 01234567890123456789 01234567890123456789
    +--------------------+--------------------+--------------------+--------------------+
    |      BOMB MODE     |Enter PASS> ********|        ARMING      |      BOMB MODE     |
    |Game time:  00:15:20|Game time:  00:15:20|***************     |Game time:  00:15:20|
    |                    |   BLUE activated   |                    |   BLUE activated   |
    |                    |Bomb time:  00:01:59|                    |Bomb time:  00:01:59|
    +--------------------+--------------------+--------------------+--------------------+*/
    static uint8_t st = 0;
    static uint32_t secs = 0;
    static uint32_t time_press_red = xTaskGetTickCount();
    static uint32_t time_press_blue = xTaskGetTickCount();
    static uint32_t start_bomb_time;
    static uint8_t progressRed = 0;
    static uint8_t progressBlue = 0;
    uint8_t redValue, blueValue;

    static bool fEmpty = true;
    static int8_t i8CheckTimeCount;             // счетчик временных треков до окончания игры
    static int8_t i8CheckBombTimeCount;         // счетчик временных треков от момента активации заряда
    static bool fCursorChange = true;
    espnow_msg_t outMsg;
    static bool activated = false;
    static bool pass_ok;                          // true-авторизация выполнена

	static uint16_t bombTimePhraseLength = getTextWidth("Bomb time: ", HEADER_FONT);
	static uint16_t timerPositionX = DISPLAY_WIDTH-getTextWidth("00:00:00", HEADER_FONT);

    redButton.read();
    blueButton.read();

    // if (pass_ok && (st > 2 && st < 6)) {
    if (pass_ok && (st > 0 && st < 6)) {
        if (G_u8Team != RED)
            redValue = ProcessButton(redButton, &progressRed, &time_press_red);
        // else
        //     redValue = 0;

        if (G_u8Team != BLUE)
            blueValue = ProcessButton(blueButton, &progressBlue, &time_press_blue);
        // else
        //     blueValue = 0;
    }

    switch (st) {
        case 0:                                   // инициализация переменных, отрисовка статической информации на дисплее
            clearScreen();
            G_u8Team = NOONE;
            pass_ok = false;
            *winner = NOONE;
            i8CheckTimeCount = getTimeMarker(secs);
            //lcd.clear();
            game_timer.SetTime(G_u32GameTimeMS);  // устанавливаем таймер игры
            // secs = 0;
            secs = game_timer.Secs();
            i8CheckTimeCount = getTimeMarker(secs);
            bomb_timer.SetTime(G_u32BombTimeMS);  // устанавливаем таймер бомбы

            // счетчик временных треков от момента активации заряда
            if (G_u32BombTimeMS < 300000)
                i8CheckBombTimeCount = 0;
            else if (G_u32BombTimeMS < 480000)
                i8CheckBombTimeCount = 1;
            else
                i8CheckBombTimeCount = 2;

            activated = false;
            st++;
            break;

        case 1:    // отрисовка команды-владельца gamepad
            RenderStaticView();
            if (*winner == NOONE)
                st++;
            else
                st = 7;
            break;

        case 2:    // ожидание авторизации
            if (!pass_ok) {
                pass_ok = enterPassword(&fCursorChange);
            }
            else
                st++;
            break;

        case 3:    // ожидание старта активации/деактивации
            if (redValue || blueValue) {
                //lcd.setCursor(0, 0);
                if (G_u8Team == NOONE) {
                    //lcd.print(F("        ARMING      "));
					printTFTText("ARMING", NO_X, 0, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                    // Проигрываем на базе команды, которая не захватывает точку
                    outMsg.data[0] = redValue ? BLUE - 1 : RED - 1;
                    outMsg.data[1] = MP3_THEY_ACTIVATE_BOMB;
                    outMsg.cmd = PLAY_TRACK;
                    if (!q_out_msg.push(&outMsg))
                        log_e("Error: q_out_msg is full");
                    }
                else {
                    //lcd.print(F("      DISARMING     "));
					printTFTText("DISARMING", NO_X, 0, CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                }
                st++;
            }
            break;

