KostantinRudenko/ESP32-Strikeball-Kit/gamepad_esp/functions.h
    fEmpty = sendESP_NOW();

    if (game_timer.isRunning()) {
        game_timer.Tick();
        // if (u8BombState == BS_RUN)
        if (activated)
            bomb_timer.Tick();

        // Если время игры истекло или таймер заряда обнулился
        if (!game_timer.GetTime() || !bomb_timer.GetTime()) {
            game_timer.Stop();
            bomb_timer.Stop();
            lcd.setCursor(12, 1);
            showTimeHMS(lcd, 0);
            lcd.setCursor(12, 3);
            showTimeHMS(lcd, bomb_timer.Secs());
            st = 6;
        }
        else if (st != 4) {
            if (game_timer.Secs() != secs) {
                lcd.setCursor(12, 1);
                secs = game_timer.Secs();
                showTimeHMS(lcd, secs);

                // if (u8BombState == BS_RUN) {
                if (activated) {
                    lcd.setCursor(12, 3);
                    showTimeHMS(lcd, bomb_timer.Secs());
                }
                tone(BUZZER_PIN, BUZZER_FREQUENCY, BUZZER_DURATION);

                fCursorChange = true;
            }

            if (i8CheckTimeCount) {
                if (secs <= arTimeMikers[i8CheckTimeCount - 1]) {
                    outMsg.cmd = PLAY_TRACK;
                    outMsg.data[0] = BROADCAST;
                    outMsg.data[1] = MP3_10S_END + i8CheckTimeCount - 1;
                    if (!q_out_msg.push(&outMsg))
                        log_e("Error: q_out_msg is full");
                    i8CheckTimeCount--;
                }
            }

        }
    }
    return false;
}
*/


bool ControlPoint(ListParameter* params, team_t* winner) {
    /*----------------------------------------------------------------------------+
    // Побеждает команда, которая за время игры успеет нажать свою кнопку большее |
    // количество раз. Таймер игры запускается по первому нажатию кнопки.         |
    // Параметр Repeat time (время блокировки повторного нажатия) задается в сек  |
    // от 0 до 999. Если 0 - промежуток между нажатиями будет рандомный. Если     |
    // нажатие разрешено, кнопка мигает.                                          |
    //----------------------------------------------------------------------------+
     01234567890123456789
    +--------------------+
    |    CONTROL POINT   |
    |Game time:  00:15:20|
    | RED points:     000|
    |BLUE points:     000|
    +--------------------+*/
    const uint32_t LO_REPEAT_TIME_MS = 5000;
    const uint32_t HI_REPEAT_TIME_MS = 30000;
    const uint32_t LONG_PRESS_MS = 100;
    //const uint8_t led_pins[2] = {RED_LED_PIN, BLUE_LED_PIN};

    static uint8_t st = 0;
    static uint32_t secs = 0;
    static bool fEmpty = true;
    static int8_t i8CheckTimeCount;                     // счетчик временных треков до окончания игры
    espnow_msg_t outMsg;
    uint8_t i;

    static Button buttons[2] = {redButton, blueButton};
    static bool pressed[2];                             // true - кнопка нажата
    static uint32_t leaving_time[2];                    // время отжатия кнопки, мс
    static uint32_t lock_time[2];                       // время блокировки повторного нажатия кнопки, мс
    static uint16_t points[2];                          // количество нажатий кнопки
    static bool fRandomTime;                            // true - рандомное время блокировки повторного нажатия кнопки

	static String pointsString;

	static uint16_t pointsPositionX = DISPLAY_WIDTH-getTextWidth("000", HEADER_FONT);
	static uint16_t timerPositionX = DISPLAY_WIDTH-getTextWidth("00:00:00", HEADER_FONT);

    switch (st) {
        case 0:                                         // инициализация переменных, отрисовка статической информации на дисплее
            //lcd.clear();
            clearScreen();
            //lcd.setCursor(4, 0);
            //lcd.print(F("CONTROL POINT"));
            printTFTText("CONTROL POINT", NO_X, 0, CENTER_BY_X, CENTER_BY_Y, HEADER_FONT);

            game_timer.SetTime(G_u32GameTimeMS);  // устанавливаем таймер игры
            secs = game_timer.Secs();
            i8CheckTimeCount = getTimeMarker(secs);

            //lcd.setCursor(0, 1);
            //lcd.print(F("Game time:"));
			printTFTText("Game time:", 0, HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            //lcd.setCursor(12, 1);
            //showTimeHMS(lcd, secs);
			printTFTText((String)secs, timerPositionX, HEADER_SPACE_H, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);

            //lcd.setCursor(0, 2);
            //lcd.print(F(" RED points:"));
			printTFTText("RED points:", 0, HEADER_SPACE_H*2, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
            //lcd.setCursor(0, 3);
            //lcd.print(F("BLUE points:"));
			printTFTText("BLUE points:", 0, HEADER_SPACE_H*3, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);

            fRandomTime = G_u32RepeatTimeMS == 0;
            for (i = 0; i < 2; i++) {
                points[i] = 0;
                pressed[i] = false;
                leaving_time[i] = 0;
                if (fRandomTime)
                    lock_time[i] = random(LO_REPEAT_TIME_MS, HI_REPEAT_TIME_MS);
                else
                    lock_time[i] = G_u32RepeatTimeMS;
                //display3DigitsInt(17, i + 2, points[i]);
				pointsString = prapare3DigitsIntVar(points[i]);
				printTFTText(pointsString, pointsPositionX, HEADER_SPACE_H+HEADER_SPACE_H*i, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                //digitalWrite(led_pins[i], pressed[i] ? LED_OFF : LED_ON);
            }
            st++;
            break;

        case 1:                                   // ожидание нажатия кнопки
            for (i = 0; i < 2; i++) {
                buttons[i].read();
                if (xTaskGetTickCount() - leaving_time[i] > lock_time[i]) {
                    if (buttons[i].isPressed())
                    {
                        pressed[i] = true;
                        //digitalWrite(led_pins[i], LED_OFF);
                    }

                    if (!pressed[i] /*&& !digitalRead(led_pins[i])*/) {
                        //digitalWrite(led_pins[i], LED_ON);
                        outMsg.cmd = PLAY_TRACK;
                        outMsg.data[0] = i;
                        outMsg.data[1] = MP3_ENABLE_CTRLPOINT;
                        if (!q_out_msg.push(&outMsg))
                            log_e("Error: q_out_msg is full");
                    }

                    else if (buttons[i].wasReleased()) {
                        if (!game_timer.isRunning())
                            game_timer.Start();
                        leaving_time[i] = xTaskGetTickCount();
                        points[i]++;
						clearSpace(pointsPositionX, HEADER_SPACE_H+HEADER_SPACE_H*i, DISPLAY_WIDTH-pointsPositionX, HEADER_SPACE_H, TFT_BLACK);
                        //display3DigitsInt(17, 2 + i, points[i]);
						pointsString = prapare3DigitsIntVar(points[i]);
						printTFTText(pointsString, pointsPositionX, HEADER_SPACE_H+HEADER_SPACE_H*i, NOT_CENTER_BY_X, NOT_CENTER_BY_Y, HEADER_FONT);
                        if (fRandomTime)
                            lock_time[i] = random(LO_REPEAT_TIME_MS, HI_REPEAT_TIME_MS);
                        pressed[i] = false;
                    }
                }
                //else
                    //digitalWrite(led_pins[i], LED_OFF);
            }
            break;

